## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # argocd_application.keda is tainted, so must be replaced
-/+ resource "argocd_application" "keda" {
!       id      = "keda" -> (known after apply)
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 7 -> (known after apply)
            name             = "keda"
!           resource_version = "4104829" -> (known after apply)
!           uid              = "f826956a-0c51-487a-bca7-e73432c8e026" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       spec {
            # (2 unchanged attributes hidden)

!           source {
                # (4 unchanged attributes hidden)

!               helm {
-                   skip_crds    = false -> null
-                   value_files  = [] -> null
                    # (1 unchanged attribute hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # argocd_project.cinema will be updated in-place
!   resource "argocd_project" "cinema" {
        id = "cinema"

!       spec {
            # (3 unchanged attributes hidden)

-           destination {
-               namespace = "cinema" -> null
-               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com" -> null
            }
-           destination {
-               namespace = "cinema" -> null
-               server    = "https://kubernetes.default.svc" -> null
            }
+           destination {
+               namespace = "kube-system"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }
+           destination {
+               namespace = "cinema"
+               server    = "https://d8e311d5-73fc-4f1b-94df-e2ea49568e78.k8s.ondigitalocean.com"
            }
+           destination {
+               namespace = "cinema"
+               server    = "https://kubernetes.default.svc"
            }
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_service_account.loadtesting_manager will be updated in-place
!   resource "kubernetes_service_account" "loadtesting_manager" {
        id                              = "kube-system/loadtesting-manager"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "loadtesting-manager-token-v66lv" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
